app/controllers/users_controller.rb

  def index

    @users = User.page(params[:page])
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "users"